kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/src/Service/Memory_Service/eeprom_emul/eeprom_emulation/eeprom_emul.c
    /* Reset global variables */
    usNbWrittenElements = (uint16_t)0U;
    ucCurrentActivePage = START_PAGE;
    ulAddressNextWrite = PAGE_HEADER_SIZE; /* Initialize write position just after page header */

 return EE_OK;
}



/**
  * @brief  Returns the last stored variable data, if found, which correspond to
  *         the passed virtual address
  * @param VirtAddress Variable virtual address on 32 bits (can't be 0x00000000 or 0xFFFFFFFF)
  * @param  pData Variable containing the 32bits read variable value
  * @retval EE_Status
  *           - EE_OK: if variable was found
  *           - EE error code: if an error occurs
  */
EE_Status xEE_ReadVariable32bits(uint32_t VirtAddress, uint32_t* pData)
{
  	if((VirtAddress != 0x00000000) && (VirtAddress != 0xFFFFFFFF))
  	{
		EE_DATA_TYPE uldatatmp = 0U;
		EE_Status status = EE_OK;

		/* Read variable of size EE_DATA_TYPE, then cast it to 32bits */
		status = prvReadVariable(VirtAddress, &uldatatmp);
		*pData = uldatatmp;

		return status;
  	}
	else
	{
		return EE_INVALID_VIRTUALADDRESS;
	}
}



/**
  * @brief  Writes/updates variable data in EEPROM.
  *         Trig internal Pages transfer if half of the pages are full.
  * @warning This function is not reentrant
  * @param VirtAddress Variable virtual address on 16 bits (can't be 0x0000 or 0xFFFF)
  * @param  Data 32bits data to be written
  * @retval EE_Status
  *           - EE_OK: on success
  *           - prvEE_CleanUp_REQUIRED: success and user has to trig flash pages cleanup
  *           - EE error code: if an error occurs
  */
EE_Status xEE_WriteVariable32bits(uint32_t VirtAddress, uint32_t Data)
{
	if((VirtAddress != 0x00000000) && (VirtAddress != 0xFFFFFFFF))
	{
		return prvWriteVariable(VirtAddress, (EE_DATA_TYPE) Data);
	}
	else
	{
		return EE_INVALID_VIRTUALADDRESS;
	}
}



/**
  * @brief  Get page state in page header
  * @param  Address Address of the FLASH Memory page
  * @retval State State of the page
  */

 EE_State_type prvGetPageState(uint32_t Address)
{
	EE_ELEMENT_TYPE status1 = 0U, status2 = 0U, status3 = 0U, status4 = 0U;

	uint8_t ucHeader_Receive_FirstWord[4] = {0x00};
	uint8_t ucHeader_Receive_SecondWord[4] = {0x00};
	uint8_t ucHeader_Active_FirstWord[4] = {0x00};
	uint8_t ucHeader_Active_SecondWord[4] = {0x00};
	uint8_t ucHeader_Valid_FirstWord[4] = {0x00};
	uint8_t ucHeader_Valid_SecondWord[4] = {0x00};
	uint8_t ucHeader_Erasing_FirstWord[4] = {0x00};
	uint8_t ucHeader_Erasing_SecondWord[4] = {0x00};

	uint32_t ulHeader_Receive_FirstWord=0;
	uint32_t ulHeader_Receive_SecondWord=0;
	uint32_t ulHeader_Active_FirstWord=0;
	uint32_t ulHeader_Active_SecondWord=0;
	uint32_t ulHeader_Valid_FirstWord=0;
	uint32_t ulHeader_Valid_SecondWord=0;
	uint32_t ulHeader_Erasing_FirstWord=0;
	uint32_t ulHeader_Erasing_SecondWord=0;


  	/* Get page state information from page header (3 first elements) */

	if(HAL_OK != xFI_ReadDoubleWord(((Address)), ucHeader_Receive_FirstWord))
	{
		return HAL_ERROR;
	}
	ulHeader_Receive_FirstWord = (ucHeader_Receive_FirstWord[0]<<24|ucHeader_Receive_FirstWord[1]<<16|ucHeader_Receive_FirstWord[2]<<8|ucHeader_Receive_FirstWord[3]);

	if(HAL_OK != xFI_ReadDoubleWord(((Address)+4U), ucHeader_Receive_SecondWord))
	{
		return HAL_ERROR;
	}
	ulHeader_Receive_SecondWord = (ucHeader_Receive_SecondWord[0]<<24|ucHeader_Receive_SecondWord[1]<<16|ucHeader_Receive_SecondWord[2]<<8|ucHeader_Receive_SecondWord[3]);

	/* Combine the two 4bytes to form the Header element 8 byte(64-bit value)*/
	status1 = ((uint64_t)ulHeader_Receive_SecondWord << 32) | ulHeader_Receive_FirstWord;


	if (HAL_OK != xFI_ReadDoubleWord(((Address  ) + EE_HEADER_ELEMENT_SIZE), ucHeader_Active_FirstWord))
	{
		return HAL_ERROR;
	}
	ulHeader_Active_FirstWord = (ucHeader_Active_FirstWord[0]<<24|ucHeader_Active_FirstWord[1]<<16|ucHeader_Active_FirstWord[2]<<8|ucHeader_Active_FirstWord[3]);

	if(HAL_OK != xFI_ReadDoubleWord((((Address) + EE_HEADER_ELEMENT_SIZE)+4U), ucHeader_Active_SecondWord))
	{
		return HAL_ERROR;
	}
	ulHeader_Active_SecondWord = (ucHeader_Active_SecondWord[0]<<24|ucHeader_Active_SecondWord[1]<<16|ucHeader_Active_SecondWord[2]<<8|ucHeader_Active_SecondWord[3]);

	/* Combine the two 4bytes to form the Header element 8 byte(64-bit value)*/
	status2 = ((uint64_t)ulHeader_Active_SecondWord << 32) | ulHeader_Active_FirstWord;


	if(HAL_OK != xFI_ReadDoubleWord(((Address) + (EE_HEADER_ELEMENT_SIZE*2U)),ucHeader_Valid_FirstWord))
	{
		return HAL_ERROR;
	}
	ulHeader_Valid_FirstWord =(ucHeader_Valid_FirstWord[0]<<24|ucHeader_Valid_FirstWord[1]<<16|ucHeader_Valid_FirstWord[2]<<8|ucHeader_Valid_FirstWord[3]);


	if(HAL_OK != xFI_ReadDoubleWord((((Address) + (EE_HEADER_ELEMENT_SIZE*2U))+4U),ucHeader_Valid_SecondWord))
	{
		return HAL_ERROR;
	}
	ulHeader_Valid_SecondWord = (ucHeader_Valid_SecondWord[0]<<24|ucHeader_Valid_SecondWord[1]<<16|ucHeader_Valid_SecondWord[2]<<8|ucHeader_Valid_SecondWord[3]);

	/* Combine the two 4bytes to form the Header element 8 byte(64-bit value)*/
	status3 = ((uint64_t)ulHeader_Valid_SecondWord << 32) | ulHeader_Valid_FirstWord;


	if(HAL_OK != xFI_ReadDoubleWord(((Address) + (EE_HEADER_ELEMENT_SIZE*3U)),ucHeader_Erasing_FirstWord))
	{
		return HAL_ERROR;
	}
	ulHeader_Erasing_FirstWord = (ucHeader_Erasing_FirstWord[0]<<24|ucHeader_Erasing_FirstWord[1]<<16|ucHeader_Erasing_FirstWord[2]<<8|ucHeader_Erasing_FirstWord[3]);

	if(HAL_OK != xFI_ReadDoubleWord((((Address) + (EE_HEADER_ELEMENT_SIZE*3U))+4U),ucHeader_Erasing_SecondWord))
	{
		return HAL_ERROR;
	}
	ulHeader_Erasing_SecondWord = (ucHeader_Erasing_SecondWord[0]<<24|ucHeader_Erasing_SecondWord[1]<<16|ucHeader_Erasing_SecondWord[2]<<8|ucHeader_Erasing_SecondWord[3]);

	/* Combine the two 4bytes to form the Header element 8 byte(64-bit value)*/
	status4 = ((uint64_t)ulHeader_Erasing_SecondWord << 32) | ulHeader_Erasing_FirstWord;


	/* Return erasing status, if element4 is not EE_PAGESTAT_ERASED value */
	if (status4 != EE_PAGESTAT_ERASED)
	{
		return STATE_PAGE_ERASING;
	}	

	/* Return valid status, if element3 is not EE_PAGESTAT_ERASED value */
	if (status3 != EE_PAGESTAT_ERASED)
	{
		return STATE_PAGE_VALID;
	}

	/* Return active status, if element2 is not EE_PAGESTAT_ERASED value */
	if (status2 != EE_PAGESTAT_ERASED)
	{
		return STATE_PAGE_ACTIVE;
	}

