kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/src/Service/Memory_Service/eeprom_emul/eeprom_emulation/eeprom_emul.c
	/* Return receive status, if element1 is not EE_PAGESTAT_ERASED value */
	if (status1 != EE_PAGESTAT_ERASED)
	{
		return STATE_PAGE_RECEIVE;
	}

	/* Return erased status, if 4 first elements are EE_PAGESTAT_ERASED value */
	return STATE_PAGE_ERASED;
}

/**
  * @brief  Set page state in page header
  * @param  Page Index of the page
  * @param  State State of the page
  * @retval EE_Status
  *           - EE_OK: on success
  *           - EE error code: if an error occurs
  */
 EE_Status prvSetPageState(uint32_t Page, EE_State_type State)
{
  uint32_t ulHeader1 = 0U;
  uint32_t ulHeader2 = 0U;
  uint32_t ulHeader3 = 0U;
  uint32_t ulHeader4 = 0U;

  uint8_t ucReceive[4] = {0xAA,0xAA,0xAA,0xAA};
  uint8_t ucActive [4]= {0xAA,0xAA,0xAA,0xAA};
  uint8_t ucValid [4]= {0xAA,0xAA,0xAA,0xAA};
  uint8_t ucErasing [4]= {0xAA,0xAA,0xAA,0xAA};

  ulHeader1 = PAGE_ADDRESS(Page);
  ulHeader2 = PAGE_ADDRESS(Page) + EE_HEADER_ELEMENT_SIZE;
  ulHeader3 = PAGE_ADDRESS(Page) + (EE_HEADER_ELEMENT_SIZE*2U);
  ulHeader4 = PAGE_ADDRESS(Page) + (EE_HEADER_ELEMENT_SIZE*3U);

  switch(State)
   {
		case STATE_PAGE_RECEIVE:
			{
			/* Set new Page status to STATE_PAGE_RECEIVE status */

				if (xFI_WriteDoubleWord(((ulHeader1)), ucReceive)!= HAL_OK)
				{
					return EE_WRITE_ERROR;
				}

				if (xFI_WriteDoubleWord(((ulHeader1)+EE_ADDRESS_OFFSET), ucReceive)!= HAL_OK)
				{
				return EE_WRITE_ERROR;
				}
				ucCurrentActivePage = Page;
			}
			break;

		case STATE_PAGE_ACTIVE:
			{
				/* Set new Page status to STATE_PAGE_ACTIVE status */
				if (xFI_WriteDoubleWord(((ulHeader2)), ucActive)!= HAL_OK)
				{
					return EE_WRITE_ERROR;
				}

				if (xFI_WriteDoubleWord(((ulHeader2)+EE_ADDRESS_OFFSET), ucActive)!= HAL_OK)
				{
					return EE_WRITE_ERROR;
				}
				ucCurrentActivePage = Page;
			}
			break;

		case STATE_PAGE_VALID:
			{
				/* Set new Page status to STATE_PAGE_VALID status */
				if (xFI_WriteDoubleWord(((ulHeader3)), ucValid)!= HAL_OK)
				{
					return EE_WRITE_ERROR;
				}
				
				if (xFI_WriteDoubleWord(((ulHeader3)+EE_ADDRESS_OFFSET), ucValid)!= HAL_OK)
				{
					return EE_WRITE_ERROR;
				}
			}
			break;

		case STATE_PAGE_ERASING:
			{
				/* Set new Page status to STATE_PAGE_ERASING status */
				if (xFI_WriteDoubleWord(((ulHeader4)), ucErasing)!= HAL_OK)
				{
					return EE_WRITE_ERROR;
				}

				if (xFI_WriteDoubleWord(((ulHeader4)+EE_ADDRESS_OFFSET), ucErasing)!= HAL_OK)
				{
					return EE_WRITE_ERROR;
				}
			}
			break;
		default: 
		break;
   }
	/* Return last operation flash status */
	return EE_OK;
}


/**
  * @brief  Erase group of pages which are erasing state.
  *         Could be either first half or second half of total pages number.
  * @retval EE_Status
  *           - EE_OK: in case of success
  *           - EE error code: if an error occurs
  */
EE_Status prvEE_CleanUp(void)
{
  uint32_t ulFirstPage = 0U;
  uint32_t ulPage = 0U;
  uint32_t ulFirstPageAddress = 0U;
  uint32_t ulPageAddress = 0U;
  EE_State_type firstpagestatus = STATE_PAGE_INVALID, pagestatus = STATE_PAGE_INVALID;

  /* Check first half and second half page group */
  for (ulFirstPage = START_PAGE; ulFirstPage < (START_PAGE + PAGES_NUMBER); ulFirstPage += PAGE_GROUP)
  	{
		/* Check status of first page of the group */
		ulFirstPageAddress = PAGE_ADDRESS(ulFirstPage);
		firstpagestatus = prvGetPageState(ulFirstPageAddress);

		/* If first page of the group is erasing state, check that all other pages
		of the group are also erasing state */
		if (firstpagestatus == STATE_PAGE_ERASING)
		{
			for (ulPage = (ulFirstPage + 1U); ulPage < (ulFirstPage + PAGE_GROUP); ulPage++)
			{
				ulPageAddress = PAGE_ADDRESS(ulPage);
				pagestatus = prvGetPageState(ulPageAddress);

				/* If page is not erasing, return error */
				if (pagestatus != STATE_PAGE_ERASING)
				{
					return EE_ERROR_NOERASING_PAGE;
				}
			}

			/* Erase all the pages of the group */
			/* If erase operation fails, a Flash error code is returned */
			for (ulPage = 0; ulPage < ((PAGES_NUMBER *PAGE_SIZE) / 2U); ulPage+=PAGE_SIZE)
			{
				if (xFI_PageErase(((PAGE_ADDRESS(ulFirstPage)+ulPage)))!= EE_OK)
				{
					return EE_ERASE_ERROR;
				}

			}
			return EE_OK;
		}
	}
	/* Error if no erasing pages group is found */
	return EE_ERROR_NOERASING_PAGE;
}


/**
  * @brief  Verify if specified page is fully erased.
  * @param  Address page address
  * @param  PageSize page size
  * @retval EE_Status
  *           - EE_PAGE_NOTERASED : if Page not erased
  *           - EE_PAGE_ERASED    : if Page erased
  */
EE_Status prvVerifyPageFullyErased(uint32_t Address, uint32_t PageSize)
{
  EE_Status readstatus = EE_PAGE_ERASED;
  uint16_t usCounter = 0U;
  uint64_t ulReadData =0U;
  uint8_t ucData[8]={0};


  /* Check each element in the page */
	while (usCounter < PageSize)
	{
		xFI_ReadDoubleWord((Address + usCounter), ucData);
		xFI_ReadDoubleWord((Address + usCounter + 4 ), &ucData[4]);

		ulReadData = (uint64_t)(ucData[0] << 56 | ucData[1] << 48 | ucData[2] << 40 | ucData[3] << 32 |
					 ucData[4] << 24 | ucData[5] << 16 | ucData[6] << 8  | ucData[7]);
		if (ulReadData!= EE_PAGESTAT_ERASED)
		{
			/* In case one element is not erased, reset readstatus flag */
			readstatus = EE_PAGE_NOTERASED;
		}

		/* Next address - Double word Location */
		usCounter = usCounter + 8;
	}

  /* Return readstatus value */
  return readstatus;
}

/**
  * @brief  Returns the last stored variable data, if found, which correspond to
  *         the passed virtual address
  * @param VirtAddress Variable virtual address on 16 bits (can't be 0x0000 or 0xFFFF)
  * @param  pData Variable containing the EE_DATA_TYPE read variable value
  * @retval EE_Status
  *           - EE_OK: if variable was found
  *           - EE error code: if an error occurs
  */

EE_Status prvReadVariable(uint32_t VirtAddress, EE_DATA_TYPE* pData)
{
	uint32_t ulPage = 0U;
	uint32_t ulPageAddress = 0U;
	uint32_t ulCounter = 0U ;
	uint8_t ucReadAddressValue[4] = {0X00,0x00,0x00,0x00};
	uint8_t ucDataValue[4] = {0x00};
	uint32_t ulReadAddr = 0;
	uint16_t usCRCRead = 0;
	uint8_t ucCRC [2]= {0x00};
	uint16_t usCRCCalculated = 0;
	uint32_t ulData = 0;
	int32_t	slRet=0;

