kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/src/Service/Memory_Service/eeprom_emul/eeprom_emulation/eeprom_emul.c
    EE_State_type pagestate = STATE_PAGE_INVALID;

    /* Get active Page for read operation */
    ulPage = prvFindPage(FIND_READ_PAGE);

    /* Check if there is no active page */
    if (ulPage == EE_NO_PAGE_FOUND)
    {
    	return EE_ERROR_NOACTIVE_PAGE;
    }
    ulPageAddress = PAGE_ADDRESS(ulPage);
    pagestate = prvGetPageState(ulPageAddress);

    /* Search variable in active page and valid pages until erased page is found
       or in erasing pages until erased page is found */
    while ((pagestate == STATE_PAGE_ACTIVE) || (pagestate == STATE_PAGE_VALID) || (pagestate == STATE_PAGE_ERASING))
    {
		/* Set counter index to last element position in the page */
//		ulCounter = (PAGE_SIZE - EE_ELEMENT_SIZE)- EMPTY_BYTES_FOR_PAGE;
    	/* Set counter index to last element written position in the active page */
    	ulCounter =  ulAddressNextWrite;
		/* Check each page address starting from end */
		while (ulCounter >= PAGE_HEADER_SIZE)
		{
			/* Get the current location content to be compared with virtual address */
			slRet = xFI_ReadDoubleWord(((ulPageAddress + ulCounter + EE_ADDRESS_OFFSET) ), ucReadAddressValue);
			if(slRet != 0)
			{
				return slRet;
			}
			ulReadAddr = (ucReadAddressValue[0]<<24|ucReadAddressValue[1]<<16|ucReadAddressValue[2]<<8|ucReadAddressValue[3]);

			if (ulReadAddr != 0xFFFFFFFFU)
        	{
				/* Compare the read address with the virtual address */
				if (ulReadAddr == VirtAddress)
				{
					/* Get content of variable value */
					xFI_ReadDoubleWord(((ulPageAddress + ulCounter)), ucDataValue);

					ulData = (ucDataValue[0]<<24|ucDataValue[1]<<16|ucDataValue[2]<<8|ucDataValue[3]);

					usCRCCalculated = xCrc16BitPolinomial_1021(ucDataValue, sizeof(ucDataValue),0);

					xFI_ReadSingleWord(((ulPageAddress + ulCounter + EE_CRC_OFFSET)), ucCRC);

					usCRCRead = (ucCRC[0]<<8|ucCRC[1]);

					if (usCRCCalculated == usCRCRead)
					{
						*pData = ulData ;
						return EE_OK;
					}
					else
					{
						return EE_READ_DATA_INVALID;
					}
        		}
        	}
        	/* Next address location */
			ulCounter -= EE_ELEMENT_SIZE;
      	}
      	/* Decrement page index circularly, among pages allocated to eeprom emulation */
		ulPage = PREVIOUS_PAGE(ulPage);
		ulPageAddress = PAGE_ADDRESS(ulPage);
		pagestate = prvGetPageState(ulPageAddress);
    }
	/* Variable is not found */
	return EE_NO_DATA;
}


/**
  * @brief  Writes/updates variable data in EEPROM
  *         Trig internal Pages transfer if half of the pages are full
  * @param VirtAddress Variable virtual address on 16 bits (can't be 0x0000 or 0xFFFF)
  * @param  Data EE_DATA_TYPE data to be written
  * @retval EE_Status
  *           - EE_OK: on success, without page transfer
  *           - prvEE_CleanUp_REQUIRED: on success, with page transfer occured
  *           - EE_FLASH_USED: flash currently used by CPU2
  *           - EE error code: if an error occurs
  */

 EE_Status prvWriteVariable(uint32_t VirtAddress, EE_DATA_TYPE Data)
{
  EE_Status status = EE_OK;

  /* Write the variable virtual address and value in the EEPROM, if not full */
  status = prvVerifyPagesFullWriteVariable(VirtAddress, Data);
  if (status == EE_PAGE_FULL)
    {
      /* In case the EEPROM pages are full, perform Pages transfer */
      return prvPagesTransfer (VirtAddress, Data, EE_TRANSFER_NORMAL);
    }
	/* Return last operation status */
	return status;
}

/**
  * @brief  Find suitable page for read/write/erase operation.
  *   It also update pages state if current page is full.
  *   And it force cleanup if all pages are full.
  * @param  Operation Type of page to be requested.
  *   This parameter can be one of the following values:
  *     @arg @ref FIND_READ_PAGE return the active page index
  *     @arg @ref FIND_WRITE_PAGE return the write page index
  *     @arg @ref FIND_ERASE_PAGE return the erase page index
  * @retval Page_Index
  *           - Page Index: on success
  *           - @ref EE_NO_PAGE_FOUND : if an error occurs
  */
uint32_t prvFindPage(EE_Find_type Operation)
{
  EE_State_type currentpagestatus = STATE_PAGE_INVALID;
  EE_State_type followingpagestatus = STATE_PAGE_INVALID;
  uint32_t ulCurrentPage = 0U;
  uint32_t ulFollowingPage = 0U;
  uint32_t ulPreviousPage = 0U;

  /* Get currentpage status */
  ulCurrentPage = ucCurrentActivePage;
  currentpagestatus = prvGetPageState(PAGE_ADDRESS(ulCurrentPage));

  /* Get followingpage status */
  ulFollowingPage = FOLLOWING_PAGE(ulCurrentPage);
  followingpagestatus = prvGetPageState(PAGE_ADDRESS(ulFollowingPage));

  /* Get previouspage status */
  ulPreviousPage = PREVIOUS_PAGE(ulCurrentPage);

  /* Write, read or erase operation */
  switch (Operation)
	{
		case FIND_WRITE_PAGE:   /* ---- Write operation ---- */

			/* Normal operation, no page transfer on going */
			if (currentpagestatus == STATE_PAGE_ACTIVE)
			{
				/* Check if active page is not full */
				if (ulAddressNextWrite < (PAGE_SIZE - EE_ELEMENT_SIZE))
				{
					/* Return current Active page */
#if(EMUL_DEBUG_ENABLE == 1)
//					printf("Writing in %ld Page (Current)\n\r", ulCurrentPage);
#endif
					return ulCurrentPage;
				}
				else
				/* No more space in current active page */
				{
#if(EMUL_DEBUG_ENABLE == 1)
//					printf("Writing in %ld Page (Following) \n\r", ulFollowingPage);
#endif
					/* Check if following page is erasing state */
					if (followingpagestatus == STATE_PAGE_ERASING)
					{
						/* Force Cleanup, as not yet performed by user */
						if (prvEE_CleanUp() != EE_OK)
						{
							return EE_NO_PAGE_FOUND;
						}
					}

					/* Set current active page in valid state */
					if (prvSetPageState(ulCurrentPage, STATE_PAGE_VALID) != EE_OK)
					{
						return EE_NO_PAGE_FOUND;
					}

					/* Set following page as active */
					if (prvSetPageState(ulFollowingPage, STATE_PAGE_ACTIVE) != EE_OK)
					{
						return EE_NO_PAGE_FOUND;
					}
					ulAddressNextWrite = PAGE_HEADER_SIZE;   /* Skip page header */
					return ulFollowingPage;         /* Following page is now active one */
				}
			}
			/* Transfer is on going, page receiving data */
			else
			{
				if (currentpagestatus == STATE_PAGE_RECEIVE)
				{
					/* Check if receive page is not full */
					if (ulAddressNextWrite < PAGE_SIZE)
					{
						/* Return current receive page */
						return ulCurrentPage;
					}
					else
					/* No more space in current receive page */
					{
						/* Check if following page is erasing state */
						if (followingpagestatus == STATE_PAGE_ERASING)
						{
							/* Force Cleanup, as not yet performed by user */
							if (prvEE_CleanUp() != EE_OK)
							{
								return EE_NO_PAGE_FOUND;
							}
						}

						/* Set current receive page in valid state */
						if (prvSetPageState(ulCurrentPage, STATE_PAGE_VALID) != EE_OK)
						{
							return EE_NO_PAGE_FOUND;
						}

