kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/src/Service/Memory_Service/eeprom_emul/eeprom_emulation/eeprom_emul.c
						/* Set following page as receive */
						if (prvSetPageState(ulFollowingPage, STATE_PAGE_RECEIVE) != EE_OK)
						{
							return EE_NO_PAGE_FOUND;
						}
						ulAddressNextWrite = PAGE_HEADER_SIZE;   /* Skip page header */
						return ulFollowingPage;         /* Following page is now active one */
					}
				}
				else
				{
				return EE_NO_PAGE_FOUND;   /* No active Page */
				}
			}

		case FIND_READ_PAGE:  /* ---- Read operation ---- */

			if (currentpagestatus == STATE_PAGE_ACTIVE)
			{
				return ulCurrentPage;
			}
			else
			{
				if (currentpagestatus == STATE_PAGE_RECEIVE)
				{
					return ulPreviousPage;
				}
				else
				{
					return EE_NO_PAGE_FOUND;   /* No active Page */
				}
			}

		case FIND_ERASE_PAGE: /* ---- Return the erased page */

			if (followingpagestatus == STATE_PAGE_ERASED)
			{
				return ulFollowingPage;
			}
			else
			{
				return EE_NO_PAGE_FOUND;  /* No erased Page */
			}

		default:
		;
  	}
  return EE_NO_PAGE_FOUND;
}

/**
  * @brief  Verify if pages are full
  *   then if not the case, writes variable in EEPROM.
  * @param  VirtAddress 16 bit virtual address of the variable
  * @param  Data @ref EE_DATA_TYPE data to be written as variable value
  * @param  Write_type Type of writing on going (see EE_Write_type)
  * @retval EE_Status
  *           - EE_OK: on success
  *           - EE_FULL: if half pages are full
  *           - EE_FLASH_USED: flash currently used by CPU2
  *           - EE error code: if an error occurs
  */

EE_Status prvVerifyPagesFullWriteVariable(uint32_t VirtAddress, EE_DATA_TYPE Data)
{
	uint16_t usCRC = 0;
	uint8_t  ucDataArray[4]={Data >> 24,Data >> 16,Data >> 8,Data};
    uint8_t  ucVirtAddressArray[4]={VirtAddress >> 24,VirtAddress >> 16,VirtAddress >> 8,VirtAddress};
	/* Check if pages are full, i.e. max number of written elements achieved */
	if (usNbWrittenElements >= NB_MAX_WRITTEN_ELEMENTS)
	{
	return EE_PAGE_FULL;
	}

	/* Get active Page for write operation */
	uint32_t activepage = prvFindPage(FIND_WRITE_PAGE);
	uint32_t activepageaddress = 0U;

	/* Check if there is no active page */
	if (activepage == EE_NO_PAGE_FOUND)
	{
		return EE_ERROR_NOACTIVE_PAGE;
	}

	activepageaddress = PAGE_ADDRESS(activepage);

	/*calculate CRC */
	usCRC = xCrc16BitPolinomial_1021(ucDataArray, sizeof(ucDataArray),0);

	uint8_t  ucCRCArray[2]={usCRC >> 8,usCRC};

	/* Program variable data, virtual address,and CRC*/
	/* If program operation was failed, a Flash error code is returned */
	if (xFI_WriteDoubleWord(((activepageaddress+ulAddressNextWrite) ), ucDataArray)!= HAL_OK)
	{
		return HAL_ERROR;
	}
	else
	{
#if(EMUL_DEBUG_ENABLE == 1)
		printf("ESW_S:Data = 0x%lx,\t",Data);
#endif
	}

	if (xFI_WriteDoubleWord((((activepageaddress+ulAddressNextWrite)+EE_ADDRESS_OFFSET) ), ucVirtAddressArray)!= HAL_OK)
	{
		return HAL_ERROR;
	}
	else
	{
#if(EMUL_DEBUG_ENABLE == 1)
		printf("VAdr = 0x%lx,\t",VirtAddress);
#endif
	}

	if (xFI_WriteSingleWord((((activepageaddress+ulAddressNextWrite)+EE_CRC_OFFSET) ), ucCRCArray)!= HAL_OK)
	{
		return HAL_ERROR;
	}
	else
	{
#if(EMUL_DEBUG_ENABLE == 1)
		printf("CRC = 0x%x\n",usCRC);
#endif
	}

	/* Increment global variables relative to write operation done*/
	ulAddressNextWrite += EE_ELEMENT_SIZE;
	usNbWrittenElements++;
#if(EMUL_DEBUG_ENABLE == 1)
//	printf( "usNbWrittenElements=%d\n\r",usNbWrittenElements);
//	printf( "ucCurrentActivePage=%d\n\r",ucCurrentActivePage);
//	printf( "ulAddressNextWrite=%lu\n\r",ulAddressNextWrite);
#endif
	return EE_OK;
}


/**
  * @brief  Writes a new variable data in fresh new page in case of normal
  *         transfer, and transfers last updated elements from full pages to
  *         empty pages in any cases.
  * @param  VirtAddress 16 bit virtual address of the new variable data
  * @param  Data @ref EE_DATA_TYPE data value of the new variable data
  * @param  Type Type of transfer.
  *         This parameter can be one of the EE_Transfer_type enum values.
  *            @arg @ref EE_TRANSFER_NORMAL Pages transfer during normal processing
  *            @arg @ref EE_TRANSFER_RECOVER Recovering pages transfer at Init
  * @retval EE_Status
  *           - prvEE_CleanUp_REQUIRED: on success
  *           - EE error code: if an error occurs
  */

EE_Status prvPagesTransfer (uint32_t VirtAddress, EE_DATA_TYPE Data, EE_Transfer_type Type)
{
	EE_State_type pagestatus = STATE_PAGE_INVALID;
	uint32_t ulPageAddress = 0U;
	uint32_t ulPage = 0U;
	uint32_t ulVarIdx = 0U;
	EE_ELEMENT_TYPE addressvalue = 0U;
	EE_Status status = EE_OK;
	EE_DATA_TYPE DataValue = 0U;
	uint8_t ucReadAddressValue[4]={0x00};
	uint8_t ucDataValue1[4]={0};

	/* Get receive Page for transfer operation */
	ulPage = prvFindPage((Type == EE_TRANSFER_NORMAL?FIND_ERASE_PAGE:FIND_WRITE_PAGE));

	if (ulPage == EE_NO_PAGE_FOUND)
	{
	  return EE_ERROR_NOERASE_PAGE;
	}

	/* Reinitialize number of data written in the pages, and current active page */
	usNbWrittenElements = 0U;
	ucCurrentActivePage = ulPage;
	ulAddressNextWrite = PAGE_HEADER_SIZE;

	/* Mark the erased page at receive state in case of normal transfer */
	/* It is already the case in recover transfer case */
	/* If program operation was failed, a Flash error code is returned */
    if (Type == EE_TRANSFER_NORMAL)
    {
      if (prvSetPageState(ulPage, STATE_PAGE_RECEIVE) != EE_OK)
      {
        return EE_WRITE_ERROR;
      }
    }

	/* Set the previous active page and all previous valid pages to erasing state */
	/* In case of recover transfer, some of these pages may already be marked erasing */
	ulPage = PREVIOUS_PAGE(ulPage);
	ulPageAddress = PAGE_ADDRESS(ulPage);
	pagestatus = prvGetPageState(ulPageAddress);

	if ((pagestatus == STATE_PAGE_ACTIVE) || (pagestatus == STATE_PAGE_ERASING))
	{
		/* Set active page to erasing */
		if (pagestatus == STATE_PAGE_ACTIVE)
		{
			if (prvSetPageState(ulPage, STATE_PAGE_ERASING) != EE_OK)
			{
				return EE_WRITE_ERROR;
			}
		}

		/* Inspect the previous pages to set all valid pages to erasing state */
		/* In case of recover, some valid pages may be already erasing state */
		ulPage = PREVIOUS_PAGE(ulPage);
		ulPageAddress = PAGE_ADDRESS(ulPage);
		pagestatus = prvGetPageState(ulPageAddress);

		while ((pagestatus == STATE_PAGE_VALID) || (pagestatus == STATE_PAGE_ERASING))
		{
			/* Set valid page to erasing */
			if (pagestatus == STATE_PAGE_VALID)
			{
				if (prvSetPageState(ulPage, STATE_PAGE_ERASING) != EE_OK)
				{
					return EE_WRITE_ERROR;
				}
			}

