kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/src/Service/Memory_Service/eeprom_emul/eeprom_emulation/eeprom_emul.c
			/* decrement page index */
			ulPage = PREVIOUS_PAGE(ulPage);
			ulPageAddress = PAGE_ADDRESS(ulPage);
			pagestatus = prvGetPageState(ulPageAddress);
		}
	}
    else
    {
		if ((Type == EE_TRANSFER_RECOVER) && (pagestatus == STATE_PAGE_VALID))
		{
			/* This can happen in case of recover transfer. It indicates that previous */
			/* transfer goes far enough to fill a complete receive page at least */
			/* (valid state). Then erasing state marking was already completed */
		}
		else
		{
			/* Inconsistent previous page state */
			return EE_INVALID_PAGE_SEQUENCE;
		}
    }
	/* In case of recover transfer, transfer must be resumed where it has been stopped */
	/* Update global variables to reflect current transfer status */
	if (Type == EE_TRANSFER_RECOVER)
	{
		/* Count number of elements already transferred in current receive page */
		for (ulVarIdx = PAGE_HEADER_SIZE; ulVarIdx < PAGE_SIZE; ulVarIdx += EE_ELEMENT_SIZE)
		{
			/* Get next element in receive page */
			xFI_ReadDoubleWord(((PAGE_ADDRESS(ucCurrentActivePage)) + ulVarIdx), ucDataValue1);
			xFI_ReadDoubleWord((((PAGE_ADDRESS(ucCurrentActivePage)) + ulVarIdx)+EE_ADDRESS_OFFSET),ucReadAddressValue );


			for (int i = 0; i < 4; i++)
			{
				addressvalue <<= 8; // Shift the existing bits to the left by 8 bits
				addressvalue |= ucDataValue1[i]; // Add the byte from DataValue
			}

			for (int i = 0; i < 4; i++)
			{
				addressvalue <<= 8; // Shift the existing bits to the left by 8 bits
				addressvalue |= ucReadAddressValue[i]; // Add the byte from ReadAddressValue
			}

			if (addressvalue != EE_PAGESTAT_ERASED)
			{
				/* Update global variables accordingly */
				usNbWrittenElements++;
				ulAddressNextWrite += EE_ELEMENT_SIZE;
			}
			else
			{
				break;
			}
		}
		/* Count number of elements already transferred in previous valid pages */
		ulPage = ucCurrentActivePage;
		for (ulVarIdx = 0U; ulVarIdx < PAGES_NUMBER; ulVarIdx++)
		{
			/* Decrement page index among circular pages list */
			ulPage = PREVIOUS_PAGE(ulPage);
			pagestatus = prvGetPageState(PAGE_ADDRESS(ulPage));

			/* Check if page is valid state */
			if (pagestatus == STATE_PAGE_VALID)
			{
				/* Update usNbWrittenElements with number of elements in page */
				usNbWrittenElements += NB_MAX_ELEMENTS_BY_PAGE;
			}
			else
			{
				break;
			}
		}
	}
	// Write the variable passed as parameter in the new active page
	// If program operation was failed, a Flash error code is returned
	if (prvVerifyPagesFullWriteVariable(VirtAddress, Data) != EE_OK)
	{
		return EE_WRITE_ERROR;
	}
	/* Transfer process: transfer variables from old to the new active page */
	/* First element in receive page can be any one, the following elements are */
	/* ordered from the beginning. */
	/* In case of recovery, Pre-Last element in receive page could be */
	/* corrupted if reset occured during write of this element, */
	/* and last element is dummy value that we have just written. */
	/* Transfer shall then resume from (usNbWrittenElements-3) variable index */

	for (ulVarIdx = 0U; ulVarIdx < (uint32_t)(sizeof((void*)eepromVariables) / sizeof((void*)eepromVariables[0])); ulVarIdx++)
	{
        /* Check each variable except the one passed as parameter */
		if ((uint32_t)eepromVariables[ulVarIdx] !=VirtAddress)
		{
			/* Read the last variable updates */
			status = prvReadVariable((uint32_t)eepromVariables[ulVarIdx], &DataValue);

			if (status == EE_OK)
			{
				/* In case variable corresponding to the virtual address was found */
				/* Transfer the variable to the new active page */
				/* If program operation was failed, a Flash error code is returned */
				status = prvVerifyPagesFullWriteVariable((uint32_t)eepromVariables[ulVarIdx], DataValue);

				if (status != EE_OK)
				{
					return status;
				}
			}
	 		else
			{
				if (status != EE_NO_DATA)
				{
					/* In case variable is not found , do nothing */
					/* Any other status is error code occurs during variable read */
					return status;
				}
			}
	    }
    }

	/* Transfer is now done, mark the receive state page as active */
	if (prvSetPageState(ucCurrentActivePage, STATE_PAGE_ACTIVE) != EE_OK)
	{
	 	return EE_WRITE_ERROR;
	}
	/* Return last operation flash status */
	if (EE_OK != prvEE_CleanUp())
	{
		return EE_ERROR_NOERASING_PAGE ;
	}
	else
	{
		return EE_OK ;
	}
}

/**
  * @brief  Restore the pages to a known good state in case of page's status
  *   corruption after a power loss.
  * @param  None.
  * @retval - Flash error code: on write Flash error
  *         - FLASH_COMPLETE: on success
  */

 EE_Status xEE_Init(EE_Erase_type EraseType)
{
	EE_State_type pagestatus = STATE_PAGE_INVALID;
	uint32_t ulPage = 0U;
	uint32_t ulPageAddress = 0U;
	uint32_t ulVarIdx = 0U;
	uint32_t ulNbActivePage = 0U;
	uint32_t ulNbActiveReceivePage = 0U;
	uint32_t ulNbValidPage = 0U;
	uint32_t ulLastValidPage = 0U;
	uint32_t ulFirstValidPage = 0U;

	EE_State_Reliability pagestate = STATE_RELIABLE;

	/* check the flash end address with calculated end address for required variables*/
	if (CALCULATED_END_ADDRESS >= FLASH_END_ADDR)
	{
		return EE_MEMORY_NOT_SUFFICIENT;
	}

	/***************************************************************************/
	/* Step 1: Handle case of reset during transfer with no receive page       */
	/*         present, by setting missing receive page state                  */
	/***************************************************************************/

	/* Check if no active page and no receive page present */
	/* Browse all pages */
	for (ulPage = START_PAGE; ulPage < (START_PAGE + PAGES_NUMBER); ulPage++)
	{
		ulPageAddress = PAGE_ADDRESS(ulPage);
		pagestatus = prvGetPageState(ulPageAddress);

		/* Search for active and receive page */
		if ((pagestatus == STATE_PAGE_ACTIVE) || (pagestatus == STATE_PAGE_RECEIVE))
		{
			ulNbActiveReceivePage++;
		}
		/* Keep index of first valid page, and last valid page */
		else if (pagestatus == STATE_PAGE_VALID)
		{
			if (ulNbValidPage == 0U)
			{
				ulFirstValidPage = ulPage;
			}
			ulLastValidPage = ulPage;
			ulNbValidPage++;
		}
	}

	/* Check if no active and no receive page have been detected */
	if (ulNbActiveReceivePage == 0U)
	{
		/* Check if valid pages have been detected */
		if (ulNbValidPage > 0U)
		{
			/* Check state of page just before first valid page.
			If it is erasing page, then page after last valid page shall be set
			to receiving state */
			if (prvGetPageState(PAGE_ADDRESS(PREVIOUS_PAGE(ulFirstValidPage))) == STATE_PAGE_ERASING)
			{
				if (prvSetPageState(FOLLOWING_PAGE(ulLastValidPage), STATE_PAGE_RECEIVE) != EE_OK)
				{
					return EE_WRITE_ERROR;
				}
			}
		}
		/* Format flash pages used for eeprom emulation in case no active, no receive, no valid pages are found */
		else
		{
			return prvEE_Format(EE_FORCED_ERASE);
		}
	}

	/*********************************************************************/
	/* Step 2: Handle case of reset during transfer, by performing       */
	/*         transfer recovery                                         */
	/*********************************************************************/

	/* Browse all pages */
	for (ulPage = START_PAGE; ulPage < (START_PAGE + PAGES_NUMBER); ulPage++)
	{
		ulPageAddress = PAGE_ADDRESS(ulPage);
		pagestatus = prvGetPageState(ulPageAddress);

		/* Check if there is receive page, meaning transfer has been interrupted */
		if (pagestatus == STATE_PAGE_RECEIVE)
		{
			/* Verify that receive page is a true one, not a corrupted page state */
			/* Check if page is not the first page of a bloc */
			if ((ulPage != START_PAGE) && (ulPage != (uint32_t)(START_PAGE + PAGE_GROUP)))
			{
				/* Check that previous page is valid state */
				if (prvGetPageState(PAGE_ADDRESS(PREVIOUS_PAGE(ulPage))) == STATE_PAGE_VALID)
				{
					/* The receive page is a true receive page */
					pagestate = STATE_RELIABLE;
				}
				else /* Previous page is not valid state */
				{
					/* The receive page is false receive page due to header corruption */
					pagestate = STATE_CORRUPTED;
				}
			}
			else /* The receive page is the first page of a bloc */
			{
				/* Check that following page is erased state */
				if (prvGetPageState(PAGE_ADDRESS(FOLLOWING_PAGE(ulPage))) == STATE_PAGE_ERASED)
				{
					/* The receive page is a true receive page */
					pagestate = STATE_RELIABLE;
				}
				else /* Following page is not erased state */
				{
					/* The receive page is false receive page due to header corruption */
					pagestate = STATE_CORRUPTED;
				}
			}

			/* If the receive page is a true receive page, resume pages transfer */
			if (pagestate == STATE_RELIABLE)
			{
				/* Initialize current active page */
				ucCurrentActivePage = ulPage;

				/* Resume the interrupted page transfer, using dummy new data */
				if (prvPagesTransfer (0U, 0U, EE_TRANSFER_RECOVER) != EE_CLEANUP_REQUIRED)
				{
					return EE_TRANSFER_ERROR;
				}
				/* transfer recovery is done, then stop searching receive page */
				break;
			}
		}
	}

	/*********************************************************************/
	/* Step 3: Verify presence of one unique active page                 */
	/*         If more than one active page, raise error                 */
	/*         If no active page present, set missing active page        */
	/*********************************************************************/

	/* Browse all pages to search for active pages */
	ulNbActivePage = 0U;
	for (ulPage = START_PAGE; ulPage < (START_PAGE + PAGES_NUMBER); ulPage++)
	{
	    ulPageAddress = PAGE_ADDRESS(ulPage);
	    pagestatus = prvGetPageState(ulPageAddress);

	    /* Search for active page */
	    if (pagestatus == STATE_PAGE_ACTIVE)
	    {
			/* Verify that active page is a true one, not a corrupted page state */
			/* Check if page is not the first page of a bloc */
			if ((ulPage != START_PAGE) && (ulPage != (uint32_t)(START_PAGE + PAGE_GROUP)))
			{
				/* Check that previous page is valid state */
				if (prvGetPageState(PAGE_ADDRESS(PREVIOUS_PAGE(ulPage))) == STATE_PAGE_VALID)
				{
					/* The active page is a true active page */
					pagestate = STATE_RELIABLE;
				}
				else /* Previous page is not valid state */
				{
					/* The active page is false active page due to header corruption */
					pagestate = STATE_CORRUPTED;
				}
	      	}
			else /* The active page is the first page of a bloc */
			{
				/* Check that following page is erased state */
				if (prvGetPageState(PAGE_ADDRESS(FOLLOWING_PAGE(ulPage))) == STATE_PAGE_ERASED)
				{
					/* The active page is a true active page */
					pagestate = STATE_RELIABLE;
				}
				else /* Following page is not erased state */
				{
					/* The active page is false active page due to header corruption */
					pagestate = STATE_CORRUPTED;
				}
			}

