kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/src/Service/Memory_Service/eeprom_emul/eeprom_emulation/eeprom_emul.c
			/* If the active page is a true active page, initialize global variables */
			if (pagestate == STATE_RELIABLE)
			{
				if (ulNbActivePage == 0U)
				{
					ucCurrentActivePage = ulPage;
					ulNbActivePage++;
				}
				else
				{
					/* Error: More than one reliable active page is present */
					return EE_INVALID_PAGE_SEQUENCE;
				}
			}
	    }
	    /* Keep index of last valid page, will be required in case no active page is found */
	    else if (pagestatus == STATE_PAGE_VALID)
	    {
			ulLastValidPage = ulPage;
	    }
	}

	/* In case no active page is found, set page after last valid page to active state */
	if (ulNbActivePage == 0U)
	{
		ucCurrentActivePage = FOLLOWING_PAGE(ulLastValidPage);
		if (prvSetPageState(ucCurrentActivePage, STATE_PAGE_ACTIVE) != EE_OK)
		{
			return EE_WRITE_ERROR;
		}
	}


	/*********************************************************************/
	/* Step 4: Initialize eeprom emulation global variables relative     */
	/*         to active page                                            */
	/*********************************************************************/

	/* Initialize global variables, with elements detected in active page */
	usNbWrittenElements = 0U;
	ulAddressNextWrite = PAGE_HEADER_SIZE;
	for (ulVarIdx = PAGE_HEADER_SIZE; ulVarIdx < (PAGE_SIZE); ulVarIdx += EE_ELEMENT_SIZE)
	{
		uint32_t ulDataValue;
		uint32_t ulReadAddressValue;
		uint8_t ucReadAddressValue[4]= {0x00};
		uint8_t ucDataValue[4]= {0x00};

		xFI_ReadDoubleWord(((PAGE_ADDRESS(ucCurrentActivePage))  + ulVarIdx), ucDataValue);

		ulDataValue = (ucDataValue[0]<<24|ucDataValue[1]<<16|ucDataValue[2]<<8|ucDataValue[3]);

		xFI_ReadDoubleWord((((PAGE_ADDRESS(ucCurrentActivePage)) + ulVarIdx)+EE_ADDRESS_OFFSET),ucReadAddressValue );

		ulReadAddressValue =(ucReadAddressValue[0]<<24|ucReadAddressValue[1]<<16|ucReadAddressValue[2]<<8|ucReadAddressValue[3]);

		if ((ulDataValue != EE_NO_DATA_FOUND) && (ulReadAddressValue != EE_NO_DATA_FOUND))
		{
			/* Then increment usNbWrittenElements and ulAddressNextWrite */
			usNbWrittenElements++;
			ulAddressNextWrite += EE_ELEMENT_SIZE;
		}
		else /* no more element in the page */
		{
			break;
		}
	}

	/*********************************************************************/
	/* Step 5: Finalize eeprom emulation global variables relative       */
	/*         to valid pages, and check consistency of pages sequence   */
	/*********************************************************************/

	/* Check consistency of pages sequence: one active page, optionnally some valid pages before */
	/* Update global variable usNbWrittenElements if valid pages are found */
	ulPage = ucCurrentActivePage;
	ulFirstValidPage = ucCurrentActivePage;
	while ((ulPage != START_PAGE) && (ulPage != (uint32_t)(START_PAGE + PAGE_GROUP)))
	{
		/* Decrement page index among circular pages list */
		ulPage = PREVIOUS_PAGE(ulPage);
		pagestatus = prvGetPageState(PAGE_ADDRESS(ulPage));

		/* Check if page is valid state */
		if (pagestatus == STATE_PAGE_VALID)
		{
			/* Update usNbWrittenElements with number of elements in full page */
			usNbWrittenElements += NB_MAX_ELEMENTS_BY_PAGE;

			/* Keep index of first valid page */
			ulFirstValidPage = ulPage;
		}
		else
		{
			/* Error: Pages sequence is not consistent */
			return EE_INVALID_PAGE_SEQUENCE;
		}
	}

	/*********************************************************************/
	/* Step 6: Ensure empty pages are erased                             */
	/*********************************************************************/

    /* Ensure all pages after active page, until first valid page, are erased */
    ulPage = FOLLOWING_PAGE(ucCurrentActivePage);
    ulPageAddress = PAGE_ADDRESS(ulPage);

    while (ulPage != ulFirstValidPage)
    {
		/* Check if page erase has to be forced unconditionally (default case) */
		if (EraseType == EE_FORCED_ERASE )
		{
			/* Force page erase independently of its content */
			if (xFI_PageErase((ulPageAddress))!= EE_OK)
			{
				return EE_ERASE_ERROR;
			}
		}
		else /* EraseType == EE_CONDITIONAL_ERASE */
		{
			/* Check if page is fully erased */
			if (prvVerifyPageFullyErased(ulPageAddress, PAGE_SIZE) == EE_PAGE_NOTERASED)
			{
				/* Erase pages if not fully erased */
				if (xFI_PageErase((ulPageAddress))!= EE_OK)
				{
					return EE_ERASE_ERROR;
				}
			}
		}

		/* Increment page index among circular pages list, to get first page to erased */
		ulPage = FOLLOWING_PAGE(ulPage);
		ulPageAddress = PAGE_ADDRESS(ulPage);
    }
#if(EMUL_DEBUG_ENABLE == 1)
//	printf( "usNbWrittenElements=%d\n\r",usNbWrittenElements);
//	printf( "ucCurrentActivePage=%d\n\r",ucCurrentActivePage);
//	printf( "ulAddressNextWrite=%lu\n\r",ulAddressNextWrite);
#endif
 return EE_OK;
}
// uint32_t xShadowUpdate(void)
 uint32_t xShadowUpdate(uint8_t ShadowPOP_flag)
 {
 	uint32_t ulPage = 0U;
 	uint32_t ulPageAddress = 0U;
 	uint32_t ulCounter = 0U;
 	volatile uint32_t ulReadAddr = 0;
 	volatile uint32_t ulData = 0;
 	uint8_t ucReadAddressValue[4] = {0X00};
 	uint8_t ucDataValue[4] = {0x00};
 	uint8_t ucCRC[2]= {0x00};
 	uint16_t usCRCRead = 0;
 	uint16_t usCRCCalculated = 0;

 	 EE_State_type pagestate = STATE_PAGE_INVALID;

 	 /* Get active Page for read operation */
 	 ulPage = prvFindPage(FIND_READ_PAGE);

 	 /* Check if there is no active page */
 	 if (ulPage == EE_NO_PAGE_FOUND)
 	 {
 		return EE_ERROR_NOACTIVE_PAGE;
 	 }
 	 ulPageAddress = PAGE_ADDRESS(ulPage);
 	 pagestate = prvGetPageState(ulPageAddress);

 	 /* Search variable in active page and valid pages until erased page is found
 		or in erasing pages until erased page is found */

 	 if (pagestate == STATE_PAGE_ACTIVE)
 	 {
 		/* Set counter index to last element position in the page */
 		ulCounter = PAGE_HEADER_SIZE ;
 		/* Check each page address starting from end */
 		while (ulCounter <= PAGE_SIZE - EMPTY_BYTES_FOR_PAGE)
 		{
 			/* Get the current location content to be compared with virtual address */
 			xFI_ReadDoubleWord(((ulPageAddress + ulCounter + EE_ADDRESS_OFFSET)), ucReadAddressValue);

 			ulReadAddr = (ucReadAddressValue[0]<<24|ucReadAddressValue[1]<<16|ucReadAddressValue[2]<<8|ucReadAddressValue[3]);

 			if (ulReadAddr != 0xFFFFFFFFU)
 			{

 				xFI_ReadDoubleWord(((ulPageAddress + ulCounter)), ucDataValue);

