kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/src/Service/Memory_Service/eeprom_emul/eeprom_emulation/eeprom_emul.c
 				ulData = (ucDataValue[0]<<24|ucDataValue[1]<<16|ucDataValue[2]<<8|ucDataValue[3]);

 				usCRCCalculated = xCrc16BitPolinomial_1021(ucDataValue, sizeof(ucDataValue),0);

 				xFI_ReadSingleWord(((ulPageAddress + ulCounter + EE_CRC_OFFSET)), ucCRC);

 				usCRCRead = (ucCRC[0]<<8|ucCRC[1]);

 				if (usCRCCalculated == usCRCRead)
 				{
 					if(ShadowPOP_flag == 1)
 					{
#if(EMUL_DEBUG_ENABLE == 1)
 						printf("ESR_S:Data = 0x%lx\t,VAdr = 0x%lx\t,CRC= 0x%x\n",ulData,ulReadAddr,usCRCRead);
#endif
 					}
 					else
 					{
 						memcpy((void *)ulReadAddr,(const void *) &ulData, sizeof(ulData));
 					}
 				}
 				else
 				{
 					return EE_READ_DATA_INVALID;
 				}
 			}
			else
			{
				/*do nothing*/
			}
 			/* Next address location */
 			ulCounter += EE_ELEMENT_SIZE;
 		}
 	 }
 	 return EE_OK;
 }

 /**
   * @brief  Initializes the shadowRAM with default values of variables
   * 		and update with last saved values in eeprom.
   * @param  None.
   * @retval None
   */


 void vShadowRAM_Init(void)
 {
 	/* Write default values into eep_Variables_t */
 	memcpy(&eep_Variables_t, &eep_default_t, sizeof(eepromData_t));

 	xShadowUpdate(0);

 }

 /**
   * @brief  Write Variables in EEPROM and ShadowRAM.
   * @param  VirtAddress Variable name to be write
   * @param  Data Data to be write
   * @param  UpdateToShadowRAM update data into shadowRAM
   * @retval Status of the operation of during EEPROM write
   */

 uint16_t xES_WriteVariable(uint32_t VirtAddress, uint32_t Data,uint32_t *UpdateToShadowRAM)
 {
 	if (BSP_ERROR_NONE == xEE_WriteVariable32bits(VirtAddress, Data)) //Write into EEPROM
 	{
 		*UpdateToShadowRAM = Data;
 		return BSP_ERROR_NONE;
 	}
 	else
 	{
 		return BSP_ERROR_COMPONENT_FAILURE;
 	}
 }
/**************************************************************************************************
 * End Of File
***************************************************************************************************/
